[
{
    "name": "Alec Resnick",
    "bio": "<a href='https://alecresnick.com' class='link dim blue'>Alec Resnick</a> is the director of Powderhouse Studios.  With a background in math and physics, he made educational tools and toys at nublabs before co-founding <a href='https://thesprouts.org' class='link dim blue'>sprout &amp; co</a>, and now Powderhouse Studios.",
    "date_joined": "2009-09-01"
},
{
    "name": "Shaunalynn Duffy",
    "bio": "Shaunalynn Duffy is a co-director at Powderhouse Studios. Born in Somerville and raised all over New England, she’s spent the past decade settling back into her hometown where she co-founded <a href='http://thesprouts.org/' class='link dim blue'>sprout & co.</a> and began running in-and-afterschool programs throughout the greater Somerville area. She also writes poetry and computer programs, rides bikes with her stepkids, plays the tuba and banjo, and co-founded <a href='http://schoolofhonk.org/' class='link dim blue'>School of HONK</a>. ",
    "date_joined": "2009-09-02"
},
{
    "name": "Bakhtiar Mikhak",
    "bio": "Bakhtiar Mikhak is one of sprout & co's founding board members and works on the design of the Powderhouse Studios' staff on-boarding process. Bakhtiar is currently the CEO of <a href='https://mediamods.com/' class='link dim blue'>Media Modifications</a>, which he co-founded after being a professor leading <a class='link dim blue' href='http://gig.media.mit.edu/'>the Grassroots Invention Group at the MIT Media Lab</a>.",
    "date_joined": "2009-10-01"
},
{
    "name": "Molly Josephs",
    "bio": "<a href='https://mollyj.org' class='link dim blue'>Molly Josephs</a> is a staff member at Powderhouse Studios as part of its founding team.  She taught biology at <a href='https://www.dalton.org' class='link dim blue'>The Dalton School</a> in New York City for years before going to Harvard's Graduate School of Education and joining sprout &amp; co in 2015.",
    "date_joined": "2015-09-01"
},
{
    "name": "Febo",
    "bio": "Anthony Febo is a Puerto Rican artist from Lowell, MA. Febo lives at the intersection of poetry, theatre, performance art, mixed media, and education. With the help of his community, he created the slam poetry scene in the city that birthed and raised him. Febo is half of the cooking and poetry duo <a href='https://adobofishsauce.com/' class='link dim blue'>Adobo-Fish-Sauce</a>. He currently resides in Cambridge with his wife, french bulldog, and his best friend which happens to be a cat.",
    "date_joined": "2018-08-01"
},
{
    "name": "Miriam Zisook",
    "bio": "<a href='http://miriamzisook.com/' class='link dim blue'>Miriam Zisook</a>  is a designer and social worker who focuses on creating <a href='http://www.miriamzisook.com/projects/' class='link dim blue'>technology</a>, <a href='http://www.perkins.org/stories/students-build-gadgets-and-confidence-in-perkins-maker-club' class='link dim blue'>programs</a> and <a href='https://chatter.cbslab.org/' class='link dim blue'>experiences</a> that support emotional wellbeing, social connection, and communication. Before coming to Powderhouse Studios Miriam worked in educational and clinical roles at the <a href='http://www.perkins.org/' class='link dim blue'>Perkins School for the Blind</a> and <a href='https://jbcc.harvard.edu/manville-school' class='link dim blue'>The Manville School</a>.",
    "date_joined": "2018-08-01"
},
{
    "name": "Rosalie Norris",
    "bio": "A director, performer, and facilitator of theatrical and dance experiences, Rosalie loves all things fun, collaborative, and embodied. Rosalie lead youth programs with <a href='http://www.citystage.org/' class='link dim blue'>City Stage Co.</a>, , and Boston Public Schools, <a href='https://web.archive.org/web/20150223233720/http://www.artscienceprize.org:80/boston/' class='link dim blue'>The ArtScience Prize</a> and currently co-leads the powerfully fun, intergenerational <a href='http://schoolofhonk.org/video-killed-the-radio-star/' class='link dim blue'>School of Honk Dance Troupe</a>. She loves trying to keep houseplants alive, and her chihuahua Piña. ",
    "date_joined": "2018-08-01"
},
{
    "name": "Maybe you?",
    "bio": "We're always looking for great people.  If you like teens, can do something they might care about, and want to join a founding team inventing the future of learning, <a href='/jobs' class='link dim blue'>get in touch</a>. Or if you know someone who might be a good fit, please <a href='/jobs/refer' class='link dim blue'>refer them</a>!",
    "date_joined": "1970-01-01"
}, ]